Entregables/Entregable_16/server/artillery.random.log
Phase started: unnamed (index: 0, duration: 1s) 09:50:27(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 09:50:28(-0300)

--------------------------------------
Metrics for period to: 09:50:30(-0300) (width: 1.13s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 897/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 25
  median: ...................................................................... 7
  p95: ......................................................................... 8.9
  p99: ......................................................................... 10.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 144.4
  max: ......................................................................... 180.7
  median: ...................................................................... 149.9
  p95: ......................................................................... 156
  p99: ......................................................................... 162.4


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 09:50:30(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 897/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 25
  median: ...................................................................... 7
  p95: ......................................................................... 8.9
  p99: ......................................................................... 10.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 144.4
  max: ......................................................................... 180.7
  median: ...................................................................... 149.9
  p95: ......................................................................... 156
  p99: ......................................................................... 162.4